; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 511793 2 3 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star6 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 infrared2)
	(have_image Phenomenon10 infrared2)
	(have_image Star11 infrared2)
	(have_image Planet12 infrared2)
	(have_image Phenomenon13 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (turn_to satellite1 star11 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star11)
   goals met: 0 of 6
4. (calibrate satellite0 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 0 of 6
5. (turn_to satellite1 planet12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet12)
   goals met: 0 of 6
6. (turn_to satellite0 star9 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
7. (turn_to satellite1 groundstation4 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 6
8. (take_image satellite0 star9 instrument2 infrared2)
   added: (have_image star9 infrared2)
   goals met: 1 of 6
9. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 1 of 6
10. (turn_to satellite0 phenomenon8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 6
11. (turn_to satellite1 star11 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star11)
   goals met: 1 of 6
12. (take_image satellite0 phenomenon8 instrument2 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 2 of 6
13. (take_image satellite1 star11 instrument3 infrared2)
   added: (have_image star11 infrared2)
   goals met: 3 of 6
14. (turn_to satellite0 planet12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet12)
   goals met: 3 of 6
15. (turn_to satellite1 planet12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet12)
   goals met: 3 of 6
16. (take_image satellite0 planet12 instrument2 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 4 of 6
17. (turn_to satellite1 phenomenon13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 6
18. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 6
19. (take_image satellite1 phenomenon13 instrument3 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 5 of 6
20. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 6
21. (take_image satellite1 phenomenon10 instrument3 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 6 of 6
